package ru.vsu.cs.okshina_v_a;

public class ListsOfStudentsFotTest {
    public static String[][] readList1(){
        String [][] data1 = new String[][]{{"1", "1", "Суворов", "Дмитрий"},
                {"1", "1", "Щёголев", "Тимофей"},
                {"1", "1", "Шаталов", "Илья"},
                {"1", "1", "Круглов", "Виталий"},
                {"1", "1", "Смотрова", "Кристина"}};

        return data1;
    }

    public static String[][] readList2(){
        String [][] data2 = new String[][]{{"1", "1", "Смотрова", "Кристина"},
                {"2", "1", "Смотрова", "Кристина"},
                {"3", "1", "Смотрова", "Кристина"},
                {"4", "1", "Смотрова", "Кристина"},
                {"2", "2", "Смотрова", "Кристина"}};

        return data2;
    }

    public static String[][] readList3(){
        String [][] data3 = new String[][]{{"1", "1", "Смотрова", "Полина"},
                {"1", "2", "Смотрова", "Екатерина"},
                {"2", "1", "Смотрова", "Зинаида"},
                {"1", "4", "Смотрова", "Мария"},
                {"3", "1", "Смотрова", "Кристина"}};

        return data3;
    }


    public static String[][] resultList1(){
        String [][] resultData1 = new String[][]{{"1", "1", "Круглов", "Виталий"},
                {"1", "1", "Смотрова", "Кристина"},
                {"1", "1", "Суворов", "Дмитрий"},
                {"1", "1", "Шаталов", "Илья"},
                {"1", "1", "Щёголев", "Тимофей"}};

        return resultData1;
    }

    public static String[][] resultList2(){
        String [][] resultData2 = new String[][]{{"1", "1", "Смотрова", "Кристина"},
                {"2", "1", "Смотрова", "Кристина"},
                {"2", "2", "Смотрова", "Кристина"},
                {"3", "1", "Смотрова", "Кристина"},
                {"4", "1", "Смотрова", "Кристина"}};

        return resultData2;
    }

    public static String[][] resultList3(){
        String [][] resultData3 = new String[][]{{"1", "1", "Смотрова", "Полина"},
                {"1", "2", "Смотрова", "Екатерина"},
                {"1", "4", "Смотрова", "Мария"},
                {"2", "1", "Смотрова", "Зинаида"},
                {"3", "1", "Смотрова", "Кристина"}};

        return resultData3;
    }
}